ДемоПримерыОбменов/src/DataProcessors/ВыгрузкаЗагрузкаXLSX/ВыгрузкаЗагрузкаXLSX.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаЗагрузкаXLSX</name>
</mdclass:DataProcessor>

ДемоПримерыОбменов/src/InformationRegisters/ДатыБронирований/ДатыБронирований.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатыБронирований</name>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>CatalogRef.Номера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДемоПримерыОбменов/src/InformationRegisters/ЗначенияХарактеристикГостиничныхНомеров/ЗначенияХарактеристикГостиничныхНомеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияХарактеристикГостиничныхНомеров</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ХарактеристикиГостиничныхНомеров</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Номера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ХарактеристикиГостиничныхНомеров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДемоПримерыОбменов/src/DataProcessors/ВыгрузкаЗагрузкаXLSX/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выгрузить(Команда)
	
	Адрес = ВыгрузитьСервер();
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов();
	ПолучитьФайлССервераАсинх(Адрес, "Выгрузка.xlsx", ПараметрыДиалога)

КонецПроцедуры

&НаКлиенте
Асинх Процедура Очистить(Команда)
	
	ТекстВопроса = "Все данные в подсистеме Бронирования будут удалены. Продолжить?";
	
	Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		ВОзврат;
	КонецЕсли;
	
	ОчиститьСервер();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Загрузить(Команда)
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов();
	ПараметрыДиалога.Фильтр = "Файл Excel (*.xlsx)|*.xlsx";
	
	Результат = Ждать ПоместитьФайлНаСерверАсинх(,,, ПараметрыДиалога);
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.ПомещениеФайлаОтменено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьСервер(Результат.Адрес);
	
	ПоказатьОповещениеПользователя("Загрузка выполнена");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыгрузитьСервер()
	
	ПакетДокументов = Новый ПакетОтображаемыхДокументов;
	
	Адрес = ПоместитьВоВременноеХранилище(ПереченьНомеров());
	ЭлементПакета = ПакетДокументов.Состав.Добавить(Адрес);
	ЭлементПакета.Наименование = "ПереченьНомеров";
	
	Адрес = ПоместитьВоВременноеХранилище(Бронирования());
	ЭлементПакета = ПакетДокументов.Состав.Добавить(Адрес);
	ЭлементПакета.Наименование = "Бронирования";
	
	Адрес = ПоместитьВоВременноеХранилище(ХарактеристикиНомеров());
	ЭлементПакета = ПакетДокументов.Состав.Добавить(Адрес);
	ЭлементПакета.Наименование = "ХарактеристикиНомеров";
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xslx");
	ПакетДокументов.Записать(ИмяВременногоФайла, ТипФайлаПакетаОтображаемыхДокументов.XLSX);
	
	ДанныеПакета = Новый ДвоичныеДанные(ИмяВременногоФайла);
	
	//@skip-check empty-except-statement - не обрабатываем ошибку удаления временного файла
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		// Невозможно удалить файл
	КонецПопытки;
	
	Результат = ПоместитьВоВременноеХранилище(ДанныеПакета);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОчиститьСервер()
	
	ОбработкаДанных.ОчиститьДанныеПодсистемыБронирований()
		
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСервер(Адрес)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
	
	ТабличныйДокумент = Новый ТабличныйДокумент();
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	ТабличныйДокумент.Прочитать(ИмяВременногоФайла);
	
	//@skip-check empty-except-statement - не обрабатываем ошибку удаления временного файла
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		// Невозможно удалить файл
	КонецПопытки;	
	
	ДанныеДляЗагрузки = ПолучитьОбластьТабличногоДокумента(ТабличныйДокумент, "ПереченьНомеров");	
	ЗагрузитьПереченьНомеров(ДанныеДляЗагрузки);
	
	ДанныеДляЗагрузки = ПолучитьОбластьТабличногоДокумента(ТабличныйДокумент, "Бронирования");
	ЗагрузитьБронирования(ДанныеДляЗагрузки);
	
	ДанныеДляЗагрузки = ПолучитьОбластьТабличногоДокумента(ТабличныйДокумент, "ХарактеристикиНомеров");
	ЗагрузитьХарактеристикиНомеров(ДанныеДляЗагрузки);
		
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьБронирования(ТабличныйДокумент)
	
	Если ТабличныйДокумент.Область(1, 1).Текст <> "ИдентификаторНомера" Тогда
		ВызватьИсключение "Отсутствует обязательная колонка ""ИдентификаторНомера""";
	КонецЕсли;
	
	Если ТабличныйДокумент.Область(1, 2).Текст <> "ДатаНачала" Тогда
		ВызватьИсключение "Отсутствует обязательная колонка ""ДатаНачала""";
	КонецЕсли;
	
	Если ТабличныйДокумент.Область(1, 3).Текст <> "ДатаОкончания" Тогда
		ВызватьИсключение "Отсутствует обязательная колонка ""ДатаОкончания""";
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ДатыБронирований.СоздатьНаборЗаписей();
	
	Для НомерСтроки = 2 По ТабличныйДокумент.ВысотаТаблицы Цикл
		
		// Извлечение данных
		ИдентификаторСтрока = ТабличныйДокумент.Область(НомерСтроки, 1).Текст;
		ДатаНачалаСтрока = ТабличныйДокумент.Область(НомерСтроки, 2).Текст;
		ДатаОкончанияСтрока = ТабличныйДокумент.Область(НомерСтроки, 3).Текст;
		
		// Нормализация данных
		Идентификатор = ПолучитьИдентификаторИзСтроки(ИдентификаторСтрока);
		Номер = Справочники.Номера.ПолучитьСсылку(Идентификатор);
		
		ДатаНачала = ПрочитатьДатуJSON(ДатаНачалаСтрока, ФорматДатыJSON.ISO);
		ДатаОкончания = ПрочитатьДатуJSON(ДатаОкончанияСтрока, ФорматДатыJSON.ISO);
		
		// Заполняем объект
		Запись = НаборЗаписей.Добавить();
		Запись.Номер = Номер;
		Запись.ДатаНачала = ДатаНачала;
		Запись.ДатаОкончания = ДатаОкончания;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();	
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьХарактеристикиНомеров(ТабличныйДокумент)
	
	Если ТабличныйДокумент.Область(1, 1).Текст <> "ИдентификаторНомера" Тогда
		ВызватьИсключение "Отсутствует обязательная колонка ""ИдентификаторНомера""";
	КонецЕсли;
	
	Если ТабличныйДокумент.Область(1, 2).Текст <> "ИдентификаторХарактеристики" Тогда
		ВызватьИсключение "Отсутствует обязательная колонка ""ИдентификаторХарактеристики""";
	КонецЕсли;
	
	Если ТабличныйДокумент.Область(1, 3).Текст <> "ТипЗначенияХарактеристики" Тогда
		ВызватьИсключение "Отсутствует обязательная колонка ""ТипЗначенияХарактеристики""";
	КонецЕсли;
	
	Если ТабличныйДокумент.Область(1, 4).Текст <> "Характеристика" Тогда
		ВызватьИсключение "Отсутствует обязательная колонка ""Характеристика""";
	КонецЕсли;
	
	Если ТабличныйДокумент.Область(1, 5).Текст <> "Значение" Тогда
		ВызватьИсключение "Отсутствует обязательная колонка ""Значение""";
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ЗначенияХарактеристикГостиничныхНомеров.СоздатьНаборЗаписей();
	
	Для НомерСтроки = 2 По ТабличныйДокумент.ВысотаТаблицы Цикл
		
		// Извлечение данных
		ИдентификаторСтрока = ТабличныйДокумент.Область(НомерСтроки, 1).Текст;
		ИдентификаторХарактеристикиСтрока = ТабличныйДокумент.Область(НомерСтроки, 2).Текст;
		ТипЗначенияХарактеристики = ТабличныйДокумент.Область(НомерСтроки, 3).Текст;
		НаименованиеХарактеристики = ТабличныйДокумент.Область(НомерСтроки, 4).Текст;
		ЗначениеХарактеристики = ТабличныйДокумент.Область(НомерСтроки, 5).Текст;
		
		// Нормализация данных
		ИдентификаторНомера = ПолучитьИдентификаторИзСтроки(ИдентификаторСтрока);
		Номер = Справочники.Номера.ПолучитьСсылку(ИдентификаторНомера);
		
		ОписаниеТипа = Новый ОписаниеТипов(ТипЗначенияХарактеристики);
		
		ИдентификаторХарактеристики = ПолучитьИдентификаторИзСтроки(ИдентификаторХарактеристикиСтрока);
		Характеристика = 
			ПланыВидовХарактеристик.ХарактеристикиГостиничныхНомеров.ПолучитьСсылку(ИдентификаторХарактеристики);
		ПВХОбъект = Характеристика.ПолучитьОбъект();
		Если ПВХОбъект = Неопределено Тогда
			ПВХОбъект = ПланыВидовХарактеристик.ХарактеристикиГостиничныхНомеров.СоздатьЭлемент();
			ПВХОбъект.УстановитьСсылкуНового(Характеристика);
		КонецЕсли;
		ПВХОбъект.Наименование = НаименованиеХарактеристики;
		ПВХОбъект.ТипЗначения = ОписаниеТипа;
		ПВХОбъект.Записать();
		
		// Заполняем объект
		Запись = НаборЗаписей.Добавить();
		Запись.Объект = Номер;
		Запись.Свойство = Характеристика;
		Запись.Значение = ОписаниеТипа.ПривестиЗначение(ЗначениеХарактеристики);
		
	КонецЦикла;
	
	НаборЗаписей.Записать();	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОбластьТабличногоДокумента(ТабличныйДокумент, ИмяОбласти)
	
	Область = ТабличныйДокумент.Области.Найти(ИмяОбласти);
	Если Область = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Отсутствует обязательный лист книги ""%1""", ИмяОбласти);
	КонецЕсли;
	
	Возврат ТабличныйДокумент.ПолучитьОбласть(ИмяОбласти);	
	
КонецФункции

&НаСервере
Процедура ЗагрузитьПереченьНомеров(ТабличныйДокумент)
	
	Если ТабличныйДокумент.Область(1, 1).Текст <> "Идентификатор" Тогда
		ВызватьИсключение "Отсутствует обязательная колонка ""Идентификатор""";
	КонецЕсли;
	
	Если ТабличныйДокумент.Область(1, 2).Текст <> "Код" Тогда
		ВызватьИсключение "Отсутствует обязательная колонка ""Код""";
	КонецЕсли;
	
	Если ТабличныйДокумент.Область(1, 3).Текст <> "Наименование" Тогда
		ВызватьИсключение "Отсутствует обязательная колонка ""Наименование""";
	КонецЕсли;	
	
	Для НомерСтроки = 2 По ТабличныйДокумент.ВысотаТаблицы Цикл
		
		// Извлечение данных
		ИдентификаторСтрока = ТабличныйДокумент.Область(НомерСтроки, 1).Текст;
		Код = ТабличныйДокумент.Область(НомерСтроки, 2).Текст;
		Наименование = ТабличныйДокумент.Область(НомерСтроки, 3).Текст;
		
		// Нормализация данных
		Идентификатор = ПолучитьИдентификаторИзСтроки(ИдентификаторСтрока);
		
		Ссылка = Справочники.Номера.ПолучитьСсылку(Идентификатор);
		
		СпрОбъект = Ссылка.ПолучитьОбъект();
		Если СпрОбъект = Неопределено Тогда
			СпрОбъект = Справочники.Номера.СоздатьЭлемент();
			СпрОбъект.УстановитьСсылкуНового(Ссылка);
		КонецЕсли;
		СпрОбъект.Код = Код;
		СпрОбъект.Наименование = Наименование;
		СпрОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИдентификаторИзСтроки(ИдентификаторСтрока)
	
	// Стандартный шаблон uuid
	Шаблон = "[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}";
	
	Если СтрПодобнаПоРегулярномуВыражению(ИдентификаторСтрока, Шаблон, Истина) Тогда
		Возврат Новый УникальныйИдентификатор(ИдентификаторСтрока);
	КонецЕсли;
	
	ВызватьИсключение "Некорректный идентификатор";
	
КонецФункции

&НаСервере
Функция ПереченьНомеров()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Номера.Ссылка)) КАК Идентификатор,
		|	Номера.Код КАК Код,
		|	Номера.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Номера КАК Номера";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = ВыборкаВТабличныйДокумент(Выборка);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Бронирования()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДатыБронирований.Номер)) КАК ИдентификаторНомера,
		|	ДатыБронирований.ДатаНачала КАК ДатаНачалаИсходная,
		|	ДатыБронирований.ДатаОкончания КАК ДатаОкончанияИсходная
		|ИЗ
		|	РегистрСведений.ДатыБронирований КАК ДатыБронирований";
		
	ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
	
	ТаблицаЗначений.Колонки.Добавить("ДатаНачала");
	ТаблицаЗначений.Колонки.Добавить("ДатаОкончания");
	
	Для Каждого Строка Из ТаблицаЗначений Цикл
		Строка.ДатаНачала = ЗаписатьДатуJSON(Строка.ДатаНачалаИсходная, ФорматДатыJSON.ISO);
		Строка.ДатаОкончания = ЗаписатьДатуJSON(Строка.ДатаОкончанияИсходная, ФорматДатыJSON.ISO);
	КонецЦикла;
	
	ТаблицаЗначений.Колонки.Удалить("ДатаНачалаИсходная");
	ТаблицаЗначений.Колонки.Удалить("ДатаОкончанияИсходная");
	
	Результат = ТаблицаЗначенийВТабличныйДокумент(ТаблицаЗначений);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ХарактеристикиНомеров()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ЗначенияХарактеристикГостиничныхНомеров.Объект)) КАК ИдентификаторНомера,
		|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ЗначенияХарактеристикГостиничныхНомеров.Свойство)) КАК ИдентификаторХарактеристики,
		|	ПРЕДСТАВЛЕНИЕ(ЗначенияХарактеристикГостиничныхНомеров.Свойство.ТипЗначения) КАК ТипЗначенияХарактеристики,
		|	ПРЕДСТАВЛЕНИЕ(ЗначенияХарактеристикГостиничныхНомеров.Свойство) КАК Характеристика,
		|	ПРЕДСТАВЛЕНИЕ(ЗначенияХарактеристикГостиничныхНомеров.Значение) КАК Значение
		|ИЗ
		|	РегистрСведений.ЗначенияХарактеристикГостиничныхНомеров КАК ЗначенияХарактеристикГостиничныхНомеров";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = ВыборкаВТабличныйДокумент(Выборка);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВыборкаВТабличныйДокумент(Выборка)
	
	Результат = Новый ТабличныйДокумент();
	
	Колонки = Выборка.Владелец().Колонки;
	НомерКолонки = 1;
	
	Для Каждого Колонка Из Колонки Цикл
		
		Результат.Область(1, НомерКолонки).Текст = Колонка.Имя;
		НомерКолонки = НомерКолонки + 1;
		
	КонецЦикла;
	
	НомерСтроки = 2;
	
	Пока Выборка.Следующий() Цикл
		
		НомерКолонки = 1;
		
		Для Каждого Колонка Из Колонки Цикл
			
			Результат.Область(НомерСтроки, НомерКолонки).Текст = Выборка[Колонка.Имя];
			НомерКолонки = НомерКолонки + 1;
			
		КонецЦикла;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТаблицаЗначенийВТабличныйДокумент(ТаблицаЗначений)
	
	Результат = Новый ТабличныйДокумент();
	
	Колонки = ТаблицаЗначений.Колонки;
	НомерКолонки = 1;
	
	Для Каждого Колонка Из Колонки Цикл
		
		Результат.Область(1, НомерКолонки).Текст = Колонка.Имя;
		НомерКолонки = НомерКолонки + 1;
		
	КонецЦикла;
	
	НомерСтроки = 2;
	
	Для Каждого Строка Из ТаблицаЗначений Цикл
		
		НомерКолонки = 1;
		
		Для Каждого Колонка Из Колонки Цикл
			
			Результат.Область(НомерСтроки, НомерКолонки).Текст = Строка[Колонка.Имя];
			НомерКолонки = НомерКолонки + 1;
			
		КонецЦикла;
		
		НомерСтроки = НомерСтроки + 1;
				
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
